function TimeTableData() {
    return {
        WEEKDAY_INBOUND: ["新木場,5:32", "新木場,5:43", "新木場,5:55", "新木場,6:06", "新木場,6:20", "新木場,6:32", "新木場,6:41", "新木場,6:47", "新木場,6:55", "新木場,7:02", "新木場,7:09", "新木場,7:16", "新木場,7:22", "新木場,7:29", "新木場,7:38", "新木場,7:43", "新木場,7:49", "新木場,7:54", "新木場,8:01", "新木場,8:06", "新木場,8:12", "新木場,8:18", "新木場,8:26", "新木場,8:31", "新木場,8:36", "新木場,8:40", "新木場,8:45", "新木場,8:49", "新木場,8:54", "新木場,8:58", "新木場,9:02", "新木場,9:08", "新木場,9:13", "新木場,9:19", "新木場,9:23", "新木場,9:28", "新木場,9:33", "新木場,9:39", "新木場,9:44", "新木場,9:53", "新木場,9:58", "新木場,10:06", "新木場,10:12", "新木場,10:22", "新木場,10:30", "新木場,10:37", "新木場,10:45", "新木場,10:55", "新木場,11:01", "新木場,11:09", "新木場,11:18", "新木場,11:26", "新木場,11:33", "新木場,11:39", "新木場,11:48", "新木場,11:55", "新木場,12:06", "新木場,12:15", "新木場,12:25", "新木場,12:34", "新木場,12:43", "新木場,12:53", "新木場,12:59", "新木場,13:08", "新木場,13:18", "新木場,13:27", "新木場,13:35", "新木場,13:45", "新木場,13:53", "新木場,14:00", "新木場,14:06", "新木場,14:15", "新木場,14:23", "新木場,14:34", "新木場,14:43", "新木場,14:53", "新木場,15:00", "新木場,15:06", "新木場,15:17", "新木場,15:26", "新木場,15:34", "新木場,15:39", "新木場,15:49", "新木場,15:55", "新木場,16:06", "新木場,16:14", "新木場,16:18", "新木場,16:27", "新木場,16:33", "新木場,16:39", "新木場,16:45", "新木場,16:54", "新木場,16:59", "新木場,17:07", "新木場,17:15", "新木場,17:22", "新木場,17:30", "新木場,17:35", "新木場,17:40", "新木場,17:46", "新木場,17:52", "新木場,17:57", "新木場,18:04", "新木場,18:09", "新木場,18:18", "新木場,18:23", "新木場,18:29", "新木場,18:34", "新木場,18:42", "新木場,18:47", "新木場,18:53", "新木場,18:58", "新木場,19:04", "新木場,19:11", "新木場,19:17", "新木場,19:22", "新木場,19:27", "新木場,19:33", "新木場,19:41", "新木場,19:48", "新木場,19:55", "新木場,20:03", "新木場,20:08", "新木場,20:16", "新木場,20:22", "新木場,20:29", "新木場,20:38", "新木場,20:44", "新木場,20:51", "新木場,21:01", "新木場,21:08", "新木場,21:17", "新木場,21:25", "新木場,21:32", "新木場,21:40", "新木場,21:51", "新木場,22:02", "新木場,22:14", "新木場,22:25", "新木場,22:34", "新木場,22:43", "新木場,22:55", "新木場,23:08", "新木場,23:18", "新木場,23:31", "新木場,23:44", "新木場,24:01"],
        WEEKDAY_OUTBOUND: ["大崎,5:42", "大崎,5:54", "大崎,6:05", "大崎,6:16", "大崎,6:25", "大崎,6:34", "大崎,6:42", "大崎,6:51", "大崎,7:01", "武蔵浦和,7:08", "大崎,7:15", "川越,7:22", "大崎,7:28", "大宮,7:33", "赤羽,7:40", "武蔵浦和,7:49", "川越,7:53", "大宮,7:59", "大宮,8:05", "大宮,8:12", "川越,8:18", "大宮,8:23", "赤羽,8:30", "大崎,8:36", "川越,8:42", "大宮,8:46", "池袋,8:51", "大崎,8:55", "大宮,9:00", "大宮,9:04", "東京テレポート,9:09", "川越,9:14", "池袋,9:19", "大崎,9:25", "大宮,9:29", "赤羽,9:33", "池袋,9:39", "大崎,9:45", "大崎,9:50", "川越,9:55", "大宮,10:03", "大宮,10:08", "大崎,10:18", "大崎,10:27", "川越,10:36", "大崎,10:44", "川越,10:52", "大崎,11:00", "大崎,11:08", "川越,11:15", "大崎,11:24", "川越,11:33", "大崎,11:41", "大崎,11:49", "川越,11:57", "大崎,12:06", "川越,12:16", "大崎,12:26", "川越,12:34", "大崎,12:45", "川越,12:55", "大崎,13:01", "大崎,13:09", "川越,13:16", "大崎,13:25", "川越,13:35", "大崎,13:45", "川越,13:55", "大崎,14:02", "大崎,14:08", "川越,14:16", "大崎,14:25", "川越,14:33", "大崎,14:40", "大崎,14:49", "川越,14:55", "大宮,15:04", "大崎,15:12", "大崎,15:20", "川越,15:32", "大崎,15:41", "川越,15:51", "大崎,15:57", "大崎,16:06", "川越,16:14", "大崎,16:20", "大崎,16:25", "川越,16:32", "大宮,16:38", "川越,16:44", "川越,16:51", "大崎,16:57", "大宮,17:04", "大崎,17:13", "赤羽,17:21", "大崎,17:26", "川越,17:32", "赤羽,17:41", "大崎,17:46", "川越,17:51", "大宮,17:57", "大崎,18:03", "川越,18:10", "大崎,18:15", "大宮,18:22", "大崎,18:28", "川越,18:33", "大宮,18:40", "大崎,18:46", "川越,18:52", "大宮,18:59", "大崎,19:03", "川越,19:10", "大崎,19:17", "大宮,19:22", "大崎,19:29", "大宮,19:35", "赤羽,19:43", "東京テレポート,19:47", "大宮,19:54", "大崎,20:01", "川越,20:05", "大崎,20:13", "大宮,20:21", "大宮,20:31", "東京テレポート,20:39", "川越,20:44", "大崎,20:50", "大宮,20:57", "川越,21:03", "川越,21:11", "川越,21:19", "川越,21:30", "大宮,21:38", "東京テレポート,21:46", "川越,21:53", "川越,22:04", "大宮,22:18", "川越,22:27", "川越,22:37", "赤羽,22:52", "大宮,23:07", "川越,23:17", "大崎,23:25", "大崎,23:39", "大崎,23:55"],
        WEEKEND_INBOUND: ["新木場,5:31", "新木場,5:44", "新木場,5:55", "新木場,6:07", "新木場,6:17", "新木場,6:25", "新木場,6:33", "新木場,6:43", "新木場,6:53", "新木場,7:04", "新木場,7:15", "新木場,7:24", "新木場,7:29", "新木場,7:37", "新木場,7:41", "新木場,7:48", "新木場,7:54", "新木場,8:01", "新木場,8:07", "新木場,8:13", "新木場,8:19", "新木場,8:27", "新木場,8:36", "新木場,8:46", "新木場,8:54", "新木場,9:00", "新木場,9:09", "新木場,9:15", "新木場,9:23", "新木場,9:28", "新木場,9:36", "新木場,9:44", "新木場,9:48", "新木場,9:55", "新木場,10:03", "新木場,10:11", "新木場,10:17", "新木場,10:25", "新木場,10:31", "新木場,10:40", "新木場,10:50", "新木場,10:57", "新木場,11:06", "新木場,11:16", "新木場,11:26", "新木場,11:34", "新木場,11:41", "新木場,11:49", "新木場,11:57", "新木場,12:06", "新木場,12:16", "新木場,12:26", "新木場,12:35", "新木場,12:43", "新木場,12:53", "新木場,13:00", "新木場,13:08", "新木場,13:18", "新木場,13:26", "新木場,13:33", "新木場,13:43", "新木場,13:53", "新木場,14:00", "新木場,14:09", "新木場,14:16", "新木場,14:26", "新木場,14:33", "新木場,14:43", "新木場,14:53", "新木場,15:00", "新木場,15:07", "新木場,15:17", "新木場,15:27", "新木場,15:34", "新木場,15:40", "新木場,15:49", "新木場,15:57", "新木場,16:07", "新木場,16:18", "新木場,16:26", "新木場,16:34", "新木場,16:41", "新木場,16:46", "新木場,16:54", "新木場,17:03", "新木場,17:10", "新木場,17:17", "新木場,17:26", "新木場,17:33", "新木場,17:40", "新木場,17:47", "新木場,17:55", "新木場,18:04", "新木場,18:13", "新木場,18:19", "新木場,18:25", "新木場,18:32", "新木場,18:38", "新木場,18:44", "新木場,18:53", "新木場,19:04", "新木場,19:13", "新木場,19:20", "新木場,19:28", "新木場,19:34", "新木場,19:42", "新木場,19:48", "新木場,19:56", "新木場,20:05", "新木場,20:16", "新木場,20:22", "新木場,20:29", "新木場,20:37", "新木場,20:48", "新木場,20:56", "新木場,21:06", "新木場,21:14", "新木場,21:22", "新木場,21:29", "新木場,21:36", "新木場,21:43", "新木場,21:51", "新木場,22:00", "新木場,22:09", "新木場,22:18", "新木場,22:24", "新木場,22:38", "新木場,22:50", "新木場,23:03", "新木場,23:14", "新木場,23:29", "新木場,23:45", "新木場,24:00"],
        WEEKEND_OUTBOUND: ["大崎,5:41", "大崎,5:54", "大崎,6:05", "大崎,6:17", "大崎,6:27", "大崎,6:35", "大崎,6:43", "大崎,6:53", "大崎,7:04", "川越,7:14", "赤羽,7:22", "大崎,7:29", "川越,7:34", "大崎,7:42", "赤羽,7:47", "川越,7:55", "東京テレポート,8:00", "大崎,8:06", "川越,8:15", "大崎,8:21", "川越,8:29", "大宮,8:37", "大宮,8:45", "川越,8:51", "大宮,9:00", "大崎,9:06", "川越,9:10", "大崎,9:20", "大宮,9:28", "川越,9:34", "大宮,9:40", "大崎,9:46", "川越,9:54", "大崎,10:00", "大宮,10:08", "大崎,10:14", "大崎,10:23", "川越,10:32", "大崎,10:41", "大崎,10:49", "川越,10:56", "大崎,11:07", "川越,11:16", "大崎,11:26", "川越,11:34", "大崎,11:42", "大崎,11:49", "川越,11:56", "大崎,12:06", "川越,12:16", "大崎,12:24", "川越,12:33", "大崎,12:40", "大崎,12:48", "川越,12:55", "大崎,13:06", "川越,13:16", "大崎,13:24", "川越,13:34", "大崎,13:42", "大崎,13:49", "川越,13:56", "大崎,14:06", "川越,14:16", "大崎,14:23", "川越,14:32", "大崎,14:39", "大崎,14:48", "川越,14:55", "大宮,15:04", "大崎,15:13", "大崎,15:23", "川越,15:32", "大崎,15:40", "大崎,15:48", "川越,15:55", "大崎,16:03", "川越,16:12", "大崎,16:20", "川越,16:29", "川越,16:36", "大崎,16:44", "川越,16:51", "大崎,16:58", "大宮,17:04", "大崎,17:14", "大宮,17:22", "川越,17:32", "大崎,17:38", "川越,17:47", "大崎,17:52", "大宮,18:00", "大宮,18:06", "川越,18:15", "大崎,18:24", "川越,18:32", "大崎,18:39", "大崎,18:45", "川越,18:53", "大崎,18:59", "大宮,19:05", "大崎,19:14", "大宮,19:26", "川越,19:36", "大崎,19:44", "大崎,19:50", "川越,19:58", "大崎,20:06", "川越,20:14", "大崎,20:21", "赤羽,20:28", "大宮,20:35", "川越,20:44", "東京テレポート,20:50", "赤羽,20:58", "大崎,21:07", "川越,21:18", "大崎,21:24", "赤羽,21:32", "大崎,21:41", "川越,21:49", "川越,21:58", "大崎,22:10", "川越,22:20", "東京テレポート,22:29", "川越,22:35", "赤羽,22:48", "大宮,23:00", "川越,23:17", "大崎,23:24", "大崎,23:39", "大崎,23:55"]
    };
}

function Train(hour, minute, arrival) {
    var departureTime = new Date(),
    arrivalStation = arrival;

    departureTime.setHours(hour);
    departureTime.setMinutes(minute);

    return {
        departureTime: departureTime,
        arrivalStation: arrival
    };
}

function TimeTable() {

    var HOUR = 60 * 60 * 1000,
        TRAIN_DIRECTION_INBOUND = "inbound",
        DEFAULT_TRAIN_DIRECTION = TRAIN_DIRECTION_INBOUND,
        _trainDirection = DEFAULT_TRAIN_DIRECTION;

    function execute() {
        restore_options();

        var timeTable = [],
            timeTableData = new TimeTableData();
        if (_trainDirection === TRAIN_DIRECTION_INBOUND) {
            if (isWeekend(new Date())) {
                timeTable = timeTableData.WEEKEND_INBOUND;
            } else {
                timeTable = timeTableData.WEEKDAY_INBOUND;
            }
        } else {
            if (isWeekend(new Date())) {
                timeTable = timeTableData.WEEKEND_OUTBOUND;
            } else {
                timeTable = timeTableData.WEEKDAY_OUTBOUND;
            }
        }

        var trains = [],
            date = new Date();
        for (var i = 0; i < timeTable.length; i++) {
            var train = convertToTrain(timeTable[i]);
            if (train.departureTime - date > 0 && train.departureTime - date < HOUR){
                trains.push(train);
            }
        }

        output(trains);
    }

    function restore_options() {
        if (localStorage["train_direction"]) {
            _trainDirection = localStorage["train_direction"];
        } else {
            _trainDirection = DEFAULT_TRAIN_DIRECTION;
        }
    }

    function output(trains) {
        outputTitle();
        outputTimeTable(trains);
    }

    function outputTitle() {
        if (_trainDirection === TRAIN_DIRECTION_INBOUND) {
            document.getElementsByTagName("h1")[0].innerHTML = "上り(新木場方面)";
        } else {
            document.getElementsByTagName("h1")[0].innerHTML = "下り(大崎方面)";
        }
    }

    function outputTimeTable(trains) {
        var timeTableDom = document.getElementById("timeTable");
        if (trains.length > 0) {
            timeTableDom.innerHTML = "<ul>";
            for (var i = 0; i < trains.length; i++) {
                timeTableDom.getElementsByTagName("ul")[0].innerHTML += "<li>" + formatDate(trains[i].departureTime) + " " + trains[i].arrivalStation + "</li>";
            }
        } else {
            timeTableDom.innerHTML = "<p>これから1時間の間に電車はありません。</p>";
        }
    }

    function convertToTrain(data) {
        var result = data.split(','),
            arrivalStation = result[0],
            result2 = result[1].split(':'),
            hour = result2[0],
            min = result2[1];
        return new Train(hour, min, arrivalStation);
    }

    function formatDate(date) {
        var h = format2Didits(date.getHours()),
            m = format2Didits(date.getMinutes());
        return h + ":" + m;
    }

    function isWeekend(date) {
        return (date.getDay() === 0 || date.getDay() === 6);
    }

    function format2Didits(n) {
        if (String(n).length > 2) {
            throw "ERROR";
        }
        return (n < 10) ? "0" + n : n;
    }

    return {
        execute: execute,
        convertToTrain: convertToTrain,
        formatDate: formatDate,
        format2Didits: format2Didits,
        outputTitle: outputTitle,
        outputTimeTable: outputTimeTable,
        isWeekend: isWeekend 
    };

}

window.onload = function () {   
    var timeTable = new TimeTable();
    timeTable.execute();
};

